# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
# your code here
orders = pd.read_csv('orders.csv')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [3]:
orders.shape

(397924, 14)

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [4]:
# your code here
orders.groupby(['CustomerID']).agg({'amount_spent':'sum'})

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40
...                  ...
18280             180.60
18281              80.82
18282             178.05
18283            2094.88
18287            1837.28

[4339 rows x 1 columns]

In [9]:
def q95(x):
    return x.quantile(0.95)

orders.groupby(['CustomerID']).agg({'amount_spent': [q95]})

           amount_spent
                    q95
CustomerID
12346        77183.6000
12347           52.8150
12348          135.0000
12349           49.5000
12350           28.1600
...                 ...
18280           23.6550
18281           16.9500
18282           24.0975
18283            6.2400
18287           69.6000

[4339 rows x 1 columns]

In [56]:
orders['VIP'] = orders['amount_spent'] > orders['amount_spent'].quantile(q=0.95)
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,VIP,Preferred
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,False,False
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,False,True
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,False,True
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,False,True
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,False,True

In [57]:
orders['Preferred'] = (orders['amount_spent'] > orders['amount_spent'].quantile(q=0.75)) & (orders['amount_spent'] < orders['amount_spent'].quantile(q=0.95))
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,VIP,Preferred
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,False,False
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,False,True
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,False,True
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,False,True
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,False,True

In [62]:
orders['VIP'] = orders['VIP'].apply(lambda x: 1 if x == True else 0)
orders.head(5)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,VIP,Preferred
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,0,0
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,0,1
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,0,1
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,0,1
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,0,1

In [59]:
orders['Preferred'] = orders['Preferred'].apply(lambda x: 1 if x == True else 0)
orders.head(5)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,VIP,Preferred
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,0,0
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,0,1
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,0,1
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,0,1
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,0,1

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [45]:
# your code here
country_top_vip = orders[orders['VIP']== True][['Country','VIP']].groupby(['Country']).count().reset_index().sort_values(by='VIP', ascending=False)
country_top_vip.head(5)

           Country    VIP
32  United Kingdom  14739
22     Netherlands   1468
10            EIRE    715
0        Australia    571
13         Germany    511

In [65]:
country_top_vip = orders[orders['VIP']== 1][['Country','VIP']].groupby(['Country']).sum().sort_values(by='VIP', ascending=False)
country_top_vip.head(5)

                  VIP
Country
United Kingdom  14739
Netherlands      1468
EIRE              715
Australia         571
Germany           511

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [77]:
# your code here
country_top_vip = orders[orders['VIP']== 1][['Country','VIP']].groupby(['Country']).sum().sort_values(by=['VIP'], ascending=False)
country_top_preferred = orders[orders['Preferred']== 1][['Country','Preferred']].groupby(['Country']).sum().sort_values(by=['Preferred'], ascending=False)

country_top_vip.head(5)

                  VIP
Country
United Kingdom  14739
Netherlands      1468
EIRE              715
Australia         571
Germany           511

In [78]:
country_top_preferred.head()

                Preferred
Country
United Kingdom      57578
Germany              2371
France               2329
EIRE                 1921
Switzerland           590

In [82]:
merged_country = pd.merge(country_top_vip,country_top_preferred,how='outer',on='Country')
merged_country.head()

                    VIP  Preferred
Country
United Kingdom  14739.0      57578
Netherlands      1468.0        458
EIRE              715.0       1921
Australia         571.0        264
Germany           511.0       2371

In [114]:
merged_country['VIP+Preferred'] = merged_country['VIP'] + merged_country['Preferred']
merged_country = merged_country.sort_values('VIP+Preferred',ascending=False)
merged_country = merged_country.fillna(0)
#merged_country.info()
merged_country = merged_country[['VIP','Preferred','VIP+Preferred']].astype(int)
merged_country.head()

                  VIP  Preferred  VIP+Preferred
Country
United Kingdom  14739      57578          72317
Germany           511       2371           2882
France            393       2329           2722
EIRE              715       1921           2636
Netherlands      1468        458           1926